app/controllers/falling_lava_controller.rb

  def save_score
    Score.create(params[:score])
---
INSERT INTO "scores" ("created_at", "score", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sun, 22 May 2016 02:50:37 UTC +00:00], ["score", 5], ["updated_at", Sun, 22 May 2016 02:50:37 UTC +00:00]]

  def statistics
    scores = Score.all.collect{|row| row[:score]}
---
SELECT "scores".* FROM "scores"